app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("location", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", "A Place"], ["address", "2416 Pelican Ln, Evans CO"], ["created_at", "2015-04-22 20:26:20.593805"], ["updated_at", "2015-04-22 20:26:20.593805"]]

  def update
    respond_to do |format|
      if @location.update(location_params)
---
UPDATE "locations" SET "address" = ?, "longitude" = ?, "latitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["address", "2342 Brookdale Rd. West, Tacoma, WA 98446"], ["longitude", -122.3788978], ["latitude", 47.1202159], ["updated_at", "2015-04-23 16:19:48.045731"], ["id", 8]]

    def set_location
      @location = Location.find(params[:id])
---
SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 40.379247) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -104.717267) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 40.379247 AND locations.longitude >= -104.717267) THEN  45.0 WHEN (locations.latitude <  40.379247 AND locations.longitude >= -104.717267) THEN 135.0 WHEN (locations.latitude <  40.379247 AND locations.longitude <  -104.717267) THEN 225.0 WHEN (locations.latitude >= 40.379247 AND locations.longitude <  -104.717267) THEN 315.0 END AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 40.0897834337783 AND 40.6687105662217 AND locations.longitude BETWEEN -105.09725363866727 AND -104.33728036133274 AND locations.id != 2)  ORDER BY distance ASC